УчетВУправляющихДляГит1/src/Reports/АнализСостоянияНалоговогоУчетаПоУСН/АнализСостоянияНалоговогоУчетаПоУСН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>АнализСостоянияНалоговогоУчетаПоУСН</name>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьОбособленныеПодразделения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоллекцияНастроек</name>
  </attributes>
  <attributes>
    <name>ДатаИзмененияУПпоНДС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимРасшифровки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Report>

УчетВУправляющихДляГит1/src/Reports/АнализСостоянияНалоговогоУчетаПоУСН/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ 

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НачалоПериода > КонецПериода Тогда		
		ТекстСообщения = НСтр("ru = 'Неправильно задан период формирования отчета!
			|Дата начала больше даты окончания периода.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Отчет.НачалоПериода",, Отказ);		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) 
		И Не УчетнаяПолитика.ПрименяетсяУСНЗаПериод(Организация, НачалоПериода, КонецДня(КонецПериода)) Тогда
		ТекстСообщения = НСтр("ru = 'Выбранная организация не применяет 
			|упрощенную систему налогообложения!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Отчет.Организация",, Отказ);	
	КонецЕсли;
	
	Если ДатаИзмененияУПпоНДС > НачалоПериода Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Отчет не может включать периоды с различным 
			|порядком признания расходов по входящему НДС.
			|Порядок признания расходов по НДС был изменен %1.
			|Измените период отчета так, чтобы указанная дата была одной из границ периода.'"),
			Формат(ДатаИзмененияУПпоНДС, "ДФ=dd.MM.yyyy"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Отчет.НачалоПериода",, Отказ);
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
#КонецЕсли
